

#Область ОбработчикиСобытийСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиент.ПриИзменении(ЭтотОбъект, Элемент, Истина, Ложь, ДанныеДляЗаполнения);
	
	Если ДанныеДляЗаполнения <> Неопределено Тогда
		ИзменитьТекущиеДанные(ДанныеДляЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьТекущиеДанные(ДанныеДляЗаполнения)
	
	Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Цена = ДанныеДляЗаполнения.Цена;
	Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Сумма = ДанныеДляЗаполнения.Цена * Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Количество;
	Объект.СписокНоменклатуры[ДанныеДляЗаполнения.НомерСтроки-1].Склад = Объект.Склад;
	
КонецПроцедуры

&НаСервере
Процедура СписокНоменклатурыКоличествоПриИзмененииНаСервере(НомерСтроки, Количество, Цена)
	
	Объект.СписокНоменклатуры[НомерСтроки-1].Сумма = Цена * Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные;
	СписокНоменклатурыКоличествоПриИзмененииНаСервере(ТекущиеДанные.НомерСтроки, ТекущиеДанные.Количество, ТекущиеДанные.Цена);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого Стр Из ТекущийОбъект.СписокНоменклатуры Цикл
		Стр.Склад = ТекущийОбъект.Склад;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

