#Область ПрограммныйИнтерфейс

Функция ПолучитьЦенуНоменклатуры(Номенклатура, НомерСтроки, ЭтоПриход, ДанныеСтруктура) Экспорт
	
	ДанныеСтруктура = Новый Структура("Номенклатура,НомерСтроки,Цена", Номенклатура, НомерСтроки);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ?(ЭтоПриход, Перечисления.ВидыЦенНоменклатуры.Закупочная, Перечисления.ВидыЦенНоменклатуры.Продажная));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеСтруктура, Выборка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
